Revit 2026 API

# GeometryObject Operators

---

The GeometryObject type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equality(GeometryObject, GeometryObject) | Determines whether two GeometryObjects are the same. |
|  | Inequality(GeometryObject, GeometryObject) | Determines whether two GeometryObjects are different. |

#### Reference

GeometryObject Class

Autodesk.Revit.DB Namespace